
## Plan Result (ithc)




### :warning: Resource Deletion will happen
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 6 to add, 2 to change, 3 to destroy.</code></pre>

* Create
  * module.storage-account.time_rotating.rotate
  * module.tt-database.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin
  * module.tt-database.terraform_data.trigger_password_reset
* Update
  * module.redis.azurerm_redis_cache.redis
  * module.storage-account.azurerm_storage_account.storage_account
* Replace
  * module.application_insights.azurerm_monitor_activity_log_alert.main[0]
  * module.storage-account.time_static.pim_expiry
  * module.tt-database.null_resource.set-user-permissions-additionaldbs[&#34;taxtribunals&#34;]


<details><summary>Change Result (Click me)</summary>

```hcl

  # module.application_insights.azurerm_monitor_activity_log_alert.main[0] must be replaced
-/+ resource "azurerm_monitor_activity_log_alert" "main" {
      ~ id                  = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/tax-tribunals-ithc/providers/Microsoft.Insights/activityLogAlerts/Application Insights daily cap reached - tax-tribunals-ithc" -> (known after apply)
      ~ name                = "Application Insights daily cap reached - tax-tribunals-ithc" -> "Application-Insights-daily-cap-reached-tax-tribunals-ithc" # forces replacement
        tags                = {
            "application"         = "tax-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/tax-tribunals-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "ithc"
            "managedBy"           = "Tax Tribunals"
        }
        # (5 unchanged attributes hidden)

      ~ criteria {
          - levels                  = [] -> null
          - resource_groups         = [] -> null
          - resource_ids            = [] -> null
          - resource_providers      = [] -> null
          - resource_types          = [] -> null
          - statuses                = [] -> null
          - sub_statuses            = [] -> null
            # (13 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.redis.azurerm_redis_cache.redis will be updated in-place
  ~ resource "azurerm_redis_cache" "redis" {
        id                                 = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/tax-tribunals-cache-ithc/providers/Microsoft.Cache/redis/tax-tribunals-cft-ithc"
        name                               = "tax-tribunals-cft-ithc"
        tags                               = {
            "application"         = "tax-tribunals"
            "autoShutdown"        = "true"
            "builtFrom"           = "https://github.com/HMCTS/tax-tribunals-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "ithc"
            "managedBy"           = "Tax Tribunals"
        }
        # (24 unchanged attributes hidden)

      ~ redis_configuration {
          - data_persistence_authentication_method  = "SAS" -> null
          ~ maxfragmentationmemory_reserved         = 125 -> 642
          ~ maxmemory_delta                         = 125 -> 642
          ~ maxmemory_reserved                      = 125 -> 642
            # (13 unchanged attributes hidden)
        }
    }

  # module.storage-account.azurerm_storage_account.storage_account will be updated in-place
  ~ resource "azurerm_storage_account" "storage_account" {
      ~ cross_tenant_replication_enabled   = true -> false
        id                                 = "/subscriptions/7a4e3bd5-ae3a-4d0c-b441-2188fee3ff1c/resourceGroups/tax-tribunals-ithc/providers/Microsoft.Storage/storageAccounts/taxtribunalssaithc"
        name                               = "taxtribunalssaithc"
      ~ tags                               = {
            "application"         = "tax-tribunals"
          ~ "autoShutdown"        = "false" -> "true"
            "builtFrom"           = "https://github.com/HMCTS/tax-tribunals-shared-infrastructure.git"
            "businessArea"        = "CFT"
            "contactSlackChannel" = "#pet"
            "environment"         = "ithc"
            "managedBy"           = "Tax Tribunals"
        }
        # (96 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.storage-account.time_rotating.rotate will be created
  + resource "time_rotating" "rotate" {
      + day              = (known after apply)
      + hour             = (known after apply)
      + id               = (known after apply)
      + minute           = (known after apply)
      + month            = (known after apply)
      + rfc3339          = (known after apply)
      + rotation_days    = 360
      + rotation_rfc3339 = (known after apply)
      + second           = (known after apply)
      + unix             = (known after apply)
      + year             = (known after apply)
    }

  # module.storage-account.time_static.pim_expiry must be replaced
-/+ resource "time_static" "pim_expiry" {
      ~ day     = 12 -> (known after apply)
      ~ hour    = 9 -> (known after apply)
      ~ id      = "2025-06-12T09:36:25Z" -> (known after apply)
      ~ minute  = 36 -> (known after apply)
      ~ month   = 6 -> (known after apply)
      ~ rfc3339 = "2025-06-12T09:36:25Z" # forces replacement -> (known after apply) # forces replacement
      ~ second  = 25 -> (known after apply)
      ~ unix    = 1749720985 -> (known after apply)
      ~ year    = 2025 -> (known after apply)
    }

  # module.tt-database.azurerm_postgresql_flexible_server_active_directory_administrator.pgsql_adadmin will be created
  + resource "azurerm_postgresql_flexible_server_active_directory_administrator" "pgsql_adadmin" {
      + id                  = (known after apply)
      + object_id           = "3c52c98b-07a3-4a97-92b9-298e86bb1ca9"
      + principal_name      = "DTS Platform Operations PostgreSQL Admin Access"
      + principal_type      = "Group"
      + resource_group_name = "tax-tribunals-infrastructure-data-ithc"
      + server_name         = "tax-tribunals-infrastructure-ithc"
      + tenant_id           = "531ff96d-0ae9-462a-8d2d-bec7c0b42082"
    }

  # module.tt-database.null_resource.set-user-permissions-additionaldbs["taxtribunals"] must be replaced
-/+ resource "null_resource" "set-user-permissions-additionaldbs" {
      ~ id       = "814738366366938051" -> (known after apply)
      ~ triggers = { # forces replacement
          + "db_reader_schemas" = "public"
          ~ "script_hash"       = "dbe0102f3129d4463913d5e01177e806bc6954005bdd98f20c242658634a1bbc" -> "88abfc1a97fc27a8f4d01362525f3b65e85409d3a475ecc79b11ad09a019e469"
            # (3 unchanged elements hidden)
        }
    }

  # module.tt-database.terraform_data.trigger_password_reset will be created
  + resource "terraform_data" "trigger_password_reset" {
      + id     = (known after apply)
      + input  = ""
      + output = (known after apply)
    }

Plan: 6 to add, 2 to change, 3 to destroy.
```

</details>


<details><summary>:information_source: Objects have changed outside of Terraform</summary>

_This feature was introduced from [Terraform v0.15.4](https://github.com/hashicorp/terraform/releases/tag/v0.15.4)._

```hcl

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.storage-account.time_rotating.rotate has been deleted
  - resource "time_rotating" "rotate" {
        id               = "2024-06-17T09:36:25Z"
      - rotation_rfc3339 = "2025-06-12T09:36:25Z" -> null
        # (9 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
```

</details>



<!-- github-comment: {"Command":"plan","PRNumber":36,"Program":"tfcmt","SHA1":"","Target":"ithc","Vars":{}} -->